RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer4_sevt.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_timer4_sevt.c
 **
 ** A detailed description is available at
 ** @link Timer4SevtGroup Timer4SEVT description @endlink
 **
 **   - 2018-11-02 CDT First version for Device Driver Library of Timer4SEVT.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_timer4_sevt.h"
#include "hc32f460_utility.h"

#if (DDL_TIMER4_SEVT_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup Timer4SevtGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter validity check for Timer4 unit  */
#define IS_VALID_TIMER4(__TMRx__)                                              \
(   (M4_TMR41 == (__TMRx__))                ||                                 \
    (M4_TMR42 == (__TMRx__))                ||                                 \
    (M4_TMR43 == (__TMRx__)))

/*!< Parameter validity check for SEVT channel  */
#define IS_VALID_SEVT_CH(x)                                                    \
(   (Timer4SevtCh0 == (x))                  ||                                 \
    (Timer4SevtCh1 == (x))                  ||                                 \
    (Timer4SevtCh2 == (x))                  ||                                 \
    (Timer4SevtCh3 == (x))                  ||                                 \
    (Timer4SevtCh4 == (x))                  ||                                 \
    (Timer4SevtCh5 == (x)))

/*!< Parameter validity check for adct buffer mode  */
#define IS_VALID_SEVT_BUF_MODE(x)                                              \
(   (SevtBufDisable          == (x))        ||                                 \
    (SevtBufCntZero          == (x))        ||                                 \
    (SevtBufCntPeak          == (x))        ||                                 \
    (SevtBufCntZeroOrCntPeak == (x))        ||                                 \
    (SevtBufCntZeroZicZero   == (x))        ||                                 \
    (SevtBufCntPeakPicZero   == (x))        ||                                 \
    (SevtBufCntZeroZicZeroOrCntPeakPicZero == (x)))

/*!< Parameter validity check for SEVT trigger event  */
#define IS_VALID_SEVT_TRG_EVT(x)                                               \
(   (SevtTrgEvtSCMUH == (x))                ||                                 \
    (SevtTrgEvtSCMUL == (x))                ||                                 \
    (SevtTrgEvtSCMVH == (x))                ||                                 \
    (SevtTrgEvtSCMVL == (x))                ||                                 \
    (SevtTrgEvtSCMWH == (x))                ||                                 \
    (SevtTrgEvtSCMWL == (x)))

/*!< Parameter validity check for SEVT OCCR selection  */
#define IS_VALID_SEVT_OCCR_SEL(x)                                              \
(   (SevtSelOCCRxh == (x))                  ||                                 \
    (SevtSelOCCRxl == (x)))

/*!< Parameter validity check for SEVT running mode  */
#define IS_VALID_SEVT_MODE(x)                                                  \
(   (SevtDelayTrigMode == (x))              ||                                 \
    (SevtCompareTrigMode == (x)))

/*!< Parameter validity check for SEVT mask time */
#define IS_VALID_SEVT_MSK(x)                                                   \
(   (Timer4SevtMask0  == (x))               ||                                 \
    (Timer4SevtMask1  == (x))               ||                                 \
    (Timer4SevtMask2  == (x))               ||                                 \
    (Timer4SevtMask3  == (x))               ||                                 \
    (Timer4SevtMask4  == (x))               ||                                 \
    (Timer4SevtMask5  == (x))               ||                                 \
    (Timer4SevtMask6  == (x))               ||                                 \
    (Timer4SevtMask7  == (x))               ||                                 \
    (Timer4SevtMask8  == (x))               ||                                 \
    (Timer4SevtMask9  == (x))               ||                                 \
    (Timer4SevtMask10 == (x))               ||                                 \
    (Timer4SevtMask11 == (x))               ||                                 \
    (Timer4SevtMask12 == (x))               ||                                 \
    (Timer4SevtMask13 == (x))               ||                                 \
    (Timer4SevtMask14 == (x))               ||                                 \
    (Timer4SevtMask15 == (x)))

/*!< Get the specified register address of the specified Timer4 unit */
#define TMR4_SCCRx(__TMR4x__, __CH__)       ((uint32_t)&(__TMR4x__)->SCCRUH + ((uint32_t)(__CH__))*4ul)
#define TMR4_SCSRx(__TMR4x__, __CH__)       ((uint32_t)&(__TMR4x__)->SCSRUH + ((uint32_t)(__CH__))*4ul)
#define TMR4_SCMRx(__TMR4x__, __CH__)       ((uint32_t)&(__TMR4x__)->SCMRUH + ((uint32_t)(__CH__))*4ul)

