RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer4_sevt.c
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set Timer4 SEVT trigger event.
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 ** \param [in] enTrgEvt                Timer4 Special-EVT Event
 ** \arg SevtTrgEvtSCMUH                Timer4 Special-EVT Event: TMR4_Ux_SCMUH
 ** \arg SevtTrgEvtSCMUL                Timer4 Special-EVT Event: TMR4_Ux_SCMUL
 ** \arg SevtTrgEvtSCMVH                Timer4 Special-EVT Event: TMR4_Ux_SCMVH
 ** \arg SevtTrgEvtSCMVL                Timer4 Special-EVT Event: TMR4_Ux_SCMVL
 ** \arg SevtTrgEvtSCMWH                Timer4 Special-EVT Event: TMR4_Ux_SCMWH
 ** \arg SevtTrgEvtSCMWL                Timer4 Special-EVT Event: TMR4_Ux_SCMWL
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_SEVT_SetTriggerEvent(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_sevt_ch_t enCh,
                                en_timer4_sevt_trigger_evt_t enTrgEvt)
{
    __IO stc_tmr4_scsr_field_t *pstcSCSR_f = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_SEVT_CH(enCh));
        DDL_ASSERT(IS_VALID_SEVT_TRG_EVT(enTrgEvt));

        /* Get actual address of register list of current channel */
        pstcSCSR_f = (__IO stc_tmr4_scsr_field_t*)TMR4_SCSRx(TMR4x, enCh);
        pstcSCSR_f->EVTOS = (uint16_t)(enTrgEvt);

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set Timer4 SEVT trigger condition.
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 ** \param [in] pstcTrigCond            The pointer of SEVT trigger condition structure
 ** \arg This parameter detail refer @ref stc_timer4_sevt_trigger_cond_t
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_SEVT_SetTriggerCond(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_sevt_ch_t enCh,
                                const stc_timer4_sevt_trigger_cond_t *pstcTrigCond)
{
    __IO stc_tmr4_scsr_field_t *pstcSCSR_f = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_SEVT_CH(enCh));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTrigCond->enUpMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTrigCond->enZeroMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTrigCond->enDownMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTrigCond->enPeakMatchCmd));

        /* Get actual address of register list of current channel */
        pstcSCSR_f = (__IO stc_tmr4_scsr_field_t*)TMR4_SCSRx(TMR4x, enCh);
        pstcSCSR_f->PEN = (uint16_t)(pstcTrigCond->enPeakMatchCmd);
        pstcSCSR_f->ZEN = (uint16_t)(pstcTrigCond->enZeroMatchCmd);
        pstcSCSR_f->UEN = (uint16_t)(pstcTrigCond->enUpMatchCmd);
        pstcSCSR_f->DEN = (uint16_t)(pstcTrigCond->enDownMatchCmd);

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Write compare or delay value to Timer4 SEVT
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Timer4 SEVT channel
 ** \arg Timer4SevtCh0                  Timer4 SEVT channel:0
 ** \arg Timer4SevtCh1                  Timer4 SEVT channel:1
 ** \arg Timer4SevtCh2                  Timer4 SEVT channel:2
 ** \arg Timer4SevtCh3                  Timer4 SEVT channel:3
 ** \arg Timer4SevtCh4                  Timer4 SEVT channel:4
 ** \arg Timer4SevtCh5                  Timer4 SEVT channel:5
 ** \param [in] u16SccrVal              Timer4 SEVT compare value
 **
 ** \retval Ok                          Compare or delay value to Timer4 SEVT is set
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_SEVT_WriteSCCR(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_sevt_ch_t enCh,
                                uint16_t u16SccrVal)
{
    __IO uint16_t *pu16SCCR = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* check parameters */
        DDL_ASSERT(IS_VALID_SEVT_CH(enCh));

        /* Get actual address of register list of current channel */
        pu16SCCR = (__IO uint16_t*)TMR4_SCCRx(TMR4x, enCh);
        *pu16SCCR = u16SccrVal;

